tap "homebrew/bundle"
tap "homebrew/services"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"

# Core CLI
brew "git"
brew "gh"
brew "wget"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tmux"
brew "starship"
brew "fastfetch"

# Editors
brew "neovim"
brew "helix"

# Languages / runtimes
brew "pyenv"
brew "uv"
brew "nvm"
brew "oven-sh/bun/bun"

# Libs in PATH
brew "openssl@3"

# Window management / status bar (macOS)
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/borders"

cask "aerospace"
cask "wezterm"
cask "neovide"
cask "sf-symbols"
